# 2. Выполнить логические побитовые операции "И", "ИЛИ" и др.
# над числами 5 и 6. Выполнить
# над числом 5 побитовый сдвиг вправо и влево на два знака.

a = 5
b = 6

print(f"a = {a} = {a:08b}")
print(f"b = {b} = {b:08b}")

print(f"\nПобитовое И (AND):\n{a} & {b} = {a:08b} & {b:08b} = {(a & b):08b} = {a & b}")
print(f"\nПобитовое ИЛИ (OR):\n{a} | {b} = {a:08b} | {b:08b} = {(a | b):08b} = {a | b}")
print(f"\nПобитовое исключающее ИЛИ (XOR):\n{a} ^ {b} = {a:08b} ^ {b:08b} = {(a ^ b):08b} = {a ^ b}")

print(f"\nПобитовый сдвиг влево (<<) на 2 знака:\n{a} << 2 = {a:08b} << 2 = {(a << 2):08b} = {a << 2}")
print(f"\nПобитовый сдвиг вправо (>>) на 2 знака:\n{a} >> 2 = {a:08b} >> 2 = {(a >> 2):08b} = {a >> 2}")